/*2020/07/30 0312020066 後藤健瑠 */
/*必須課題C2-1*/
#include<stdio.h>

int main(void)
{
	int n, m;
	m = 2;
	printf("nを入力してください");
	scanf("%d", &n);
	printf("入力した数値は%dです\n", n);
	printf("mを加算すると%dです", n + m);
}

/*
nを入力してください6
入力した数値は6です
mを加算すると8です
C:\Users\MSLap\source\repos\必須課題C2-1\必須課題C2-1\Debug\必須課題C2-1.exe (プロセス 17396) は、コード 0 で終了しまし た。
このウィンドウを閉じるには、任意のキーを押してください...
*/

/*
nを入力してください-4
入力した数値は-4です
mを加算すると-2です
C:\Users\MSLap\source\repos\必須課題C2-1\必須課題C2-1\Debug\必須課題C2-1.exe (プロセス 10548) は、コード 0 で終了しまし た。
このウィンドウを閉じるには、任意のキーを押してください...
*/